dancekickrun/DKRZero/ESP32TrackerManager.cpp
// Copyright (c) 2018 by Chris Steer.
// All Rights Reserved.
// This program is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with this program.  If not, see <http://www.gnu.org/licenses/>.

#include "ESP32TrackerManager.h"

ESP32TrackerManager::ESP32TrackerManager() : ESP32_State(State::Initialize)
{

  pinMode(0, INPUT_PULLUP);
  pinMode(5, OUTPUT);
  // Aux led
  pinMode(13, OUTPUT);

  /**
  * Defaults go here
  */
  fSilentRunning = false;
  fStateUpdated = false;
  fMessageCount = 0 ;
  // fSensorFusionEnable = false;
  fMeasurementInterval = -1;

  AccelSetup=false;
  GyroSetup=false;
  MagSetup=false;


  // For button 0 to enter another mode (i.e. listening for configuration updates)
  // const int BUTTON_PIN = 0;
  // pinMode(BUTTON_PIN, INPUT_PULLUP);

  fLEDState = LOW;

  // Serial communications
  Serial.begin(115200);


  // Read the configuration file and initialize the processors vector

  ax=0;ay=0;az=0;gx=0;gy=0;gz=0;mx=0;my=0;mz=0;

};

// void ESP32TrackerManager::CheckFTP(){
//
//   // fESP32Config->GetFTPServer()->handleFTP(); //make sure in loop you call handleFTP()!!
// }


void ESP32TrackerManager::SetTime(){

  long day = 86400000; // 86400000 milliseconds in a day
  long hour = 3600000; // 3600000 milliseconds in an hour
  long minute = 60000; // 60000 milliseconds in a minute
  long second =  1000; // 1000 milliseconds in a second
  long millisecond =  1; // 1000 milliseconds in a second

  if(ESP32_State == State::Initialize){
    fStartTime = millis();
    fHours = (fCurrentTime % day) / hour;                       //the remainder from days division (in milliseconds) divided by hours, this gives the full hours
    fMinutes = ((fCurrentTime % day) % hour) / minute ;         //and so on...
    fSeconds = (((fCurrentTime % day) % hour) % minute) / second;
    fMilliseconds = ((((fCurrentTime % day) % hour) % minute) % second) / millisecond;
  } else {
    fCurrentTime = millis();
    // int days = timeNow / day ;                                //number of days
    // fHours = (fCurrentTime % day) / hour;                       //the remainder from days division (in milliseconds) divided by hours, this gives the full hours
    // fMinutes = ((fCurrentTime % day) % hour) / minute ;         //and so on...
    // fSeconds = (((fCurrentTime % day) % hour) % minute) / second;
    // fMilliseconds = ((((fCurrentTime % day) % hour) % minute) % second) / millisecond;
  }


}

/*
*
* [ESP32TrackerManager::ConfigureSDCard ]
* The SD card needs to be mounted in order to read the configuration file config.txt
*
*/
void ESP32TrackerManager::ConfigureSDCard()
{
  // Mount SD Card
  if(!SD.begin(33, SPI, 200*10000000, "/sd")) PrintError(Error::SDCardMountFail, String("Card Mount Failed."));
  return;
  Serial.println("INFO: SD Card Mounted Successfully ");

  // Get the card type
  uint8_t cardType = SD.cardType();
  if(cardType == CARD_NONE) PrintError(Error::NoSDCard, String("No SD Card found -> Please insert a SD card with an initialisation file."));

    Serial.print("INFO: SD Card Type: ");
    if(cardType == CARD_MMC){
      Serial.println("MMC");
      // fInfoFile.print("MMC");
    } else if(cardType == CARD_SD){
      Serial.println("SDSC");
      // fInfoFile.print("SDSC");
    } else if(cardType == CARD_SDHC){
      Serial.println("SDHC");
      // fInfoFile.print("SDHC");
    } else {
      Serial.println("UNKNOWN");
      // fInfoFile.print("UNKNOWN");
    }

  uint64_t cardSize = SD.cardSize() / (1024 * 1024);
  Serial.printf("INFO: SD Card Size: %lluMB\n", cardSize);

};


/**
 * [ESP32TrackerManager::Configure]
 * This is the entry point for starting up the unit
 */
void ESP32TrackerManager::Configure(){

  // Flash the lights before start-up
  digitalWrite(5, 1);
  delay(3000);
  digitalWrite(5, 0);
  digitalWrite(13, 1);
  delay(3000);
  digitalWrite(13, 0);

  Serial.println("INFO: Configuring SD Card");
  // Open the SD Card
  ConfigureSDCard();


  /**
  * This reads and parses  the config.txt file
  */
  // Open file for reading
  const char *filename = "/config.txt";

  // Load the JSON file
  File file = SD.open(filename);

  // Check if the file hasn't been found here
  if(!file) PrintError(Error::ConfigOpenFail, String("Failed to open configuration file."));

  // Allocate the memory pool on the stack.
  // Don't forget to change the capacity to match your JSON document.
  // Use arduinojson.org/assistant to compute the capacity.
  const size_t bufferSize = JSON_OBJECT_SIZE(28) + 780;
  DynamicJsonBuffer jsonBuffer(bufferSize);

  // Parse the root object
  JsonObject& root = jsonBuffer.parseObject(file);

  // Throw error if fail
  if (!root.success()) PrintError(Error::ConfigReadFail, String("Failed to read configuration file."));

  // Comms with the GPS unit
  // fESP32Config->GetGPSSerial()->begin(9600);

  // - Setup using the configuration class
  // fESP32Config->Configure(root);

  // Get the desired data rate (if -1 then free running)
  if(root.containsKey("desired_data_rate")){
    fDesiredDataRate = (float) root["desired_data_rate"];
  } else {
    fDesiredDataRate = -1;
  }
  // Need to check if this json field exists first?
  Serial.print("INFO: Desired Sample Rate is "); Serial.println(fDesiredDataRate);

  // Set up the sensors
  SetupSensors(root);
  // Set up the connections
  SetupConnections(root);
  // Now get the data processors
  SetupProcessors(root);

  // ESP32 should be configured by now
  fMeasurementInterval = 1000.0/fDesiredDataRate;// Rate in s-1
  Serial.print("INFO: Measurement Interval (ms) "); Serial.println(fMeasurementInterval);

