dancekickrun/DKRZero/ESP32TrackerManager.cpp
  // Initialize the time
  SetTime();
  fLastTime=fCurrentTime;

  // ... and the IMU unit
  StartIMU();
  delay(100);

  // Change the state of the unit to acquire data
  ESP32_State = State::Acquisition;

}

void ESP32TrackerManager::PrintError(int e, String err_string)
{

  while(1){
    Serial.println(String("ERROR: ") + err_string);
    Indicator(e+2,100,100,1000);
  }

}




void ESP32TrackerManager::SetupSensors(JsonObject &root)
{
  Serial.println("");
  Serial.println("===============================");
  Serial.println("INFO: Setting up sensors");


  // Look for the sensors block
  JsonArray& json_sensors = root["sensors"];
  for (auto& sensor : json_sensors)
  {
    fSensors.push_back(SensorFactory::ConstructSensor(sensor));

    // Print the type
    Serial.print("INFO: Found sensor type "); Serial.println((int) (fSensors.back())->GetType());

  }

  Serial.print("INFO: Found "); Serial.print((int) fSensors.size()); Serial.println(" sensors");
  Serial.println("===============================");
  Serial.println("");

  // SetupGyroscope(root);
  // SetupAccelerometer(root);
  // SetupMagnetometer(root);
  // SetupGPS(root);
  // SetupTemperature(root);
  // SetupMessenger(root);

}


void ESP32TrackerManager::SetupConnections(JsonObject &root)
{
  Serial.println("===============================");
  Serial.println("INFO: Setting up connections");

  // Loop over all elements that are within the processors
  JsonArray& json_connections = root["connections"];
  for (auto& connection : json_connections) fConnections.push_back(ConnectionFactory::ConstructConnection(connection));

  Serial.println("===============================");
  Serial.println("");
}


void ESP32TrackerManager::SetupProcessors(JsonObject &root)
{
  Serial.println("");
  Serial.println("===============================");
  Serial.println("INFO: Setting up processors");

  // Loop over all elements that are within the processors
  JsonArray& json_processors = root["processors"];
  for (auto& process : json_processors) fProcessors.push_back(ProcessFactory::ConstructProcess(process));

  Serial.println("===============================");
  Serial.println("");

}








// ESP32Connection* ESP32TrackerManager::ConnectionFactory(JsonObject &connection)
// {
//
//   // Get the connection type from the config txt
//   const char* type = connection["type"];
//
//   // connections to check against
//   const char* wifi_connection_name = "wifi";
//   const char* ble_connection_name = "ble";
//   const char* sdcard_connection_name = "sdcard";
//
//   // For wifi connections
//   if (strcmp(type, wifi_connection_name) == 0){
//
//     // Find the password and ssid
//     const char* ssid =  connection["ssid"];
//     const char* password =  connection["password"];
//     int attempts = connection["attempts"];
//
//     // Check if the user would like a ftp server
//     bool ftp_enable = (bool) connection["ftp_enable"];
//     //
//     if(ftp_enable){
//       return (new ESP32FTPConnection(ssid,password,attempts));
//     } else {
//       // return a wifi connection
//       return (new ESP32WifiConnection(ssid,password,attempts));
//     }
//
//
//   }
//   else if (strcmp(type, ble_connection_name) == 0)
//   {
//     Serial.println("INFO: Setting up BLE connection");
//
//     // const char* device_uuid = connection["characteristic_uuid"];
//     // const char* service_uuid = connection["service_uuid"];
//     // const char* mode = connection["mode"];
//
//     // return a ble connection
//     return new ESP32BLEConnection();
//
//   }
//   else if(strcmp(type, sdcard_connection_name) == 0)
//   {
//
//     const char* stub =  connection["stub_filename"];
//     int cont_acq_char =  (int) connection["continuous_acquisition"];
//     bool cont_acq =  (bool) cont_acq_char;
//
//     Serial.println("INFO: Setting up SD card connection");
//
//     Serial.print("INFO: Using stub filename ");
//     Serial.println(stub);
//
//     Serial.print("INFO: Using continous bool flag ");
//     Serial.println(cont_acq);
//
//     return new ESP32SDCardConnection(stub, cont_acq);
//
//     // // Check if empty
//     // if((stub==NULL)&&(cont_acq_char==NULL)){
//     //   Serial.println("INFO: Setting up SD card connection");
//     //   return new ESP32SDCardConnection();
//     // }
//     //
//     // if((stub!=NULL)&&(cont_acq_char==NULL))
//     // {
//     //   Serial.println("INFO: Setting up SD card connection");
//     //   Serial.print("INFO: Using stub filename ");
//     //   Serial.println(stub);
//     //   return new ESP32SDCardConnection(stub);
//     // }
//     //
//     // if((stub==NULL)&&(cont_acq_char!=NULL))
//     // {
//     //   Serial.println("INFO: Setting up SD card connection");
//     //   Serial.print("INFO: Using continous bool flag ");
//     //   Serial.println(cont_acq);
//     //   return new ESP32SDCardConnection(cont_acq);
//     // }
//     //
//     // if((stub!=NULL)&&(cont_acq_char!=NULL))
//     // {
//     //   Serial.println("INFO: Setting up SD card connection");
//     //   Serial.print("INFO: Using stub filename ");
//     //   Serial.println(stub);
//     //   Serial.print("INFO: Using continous bool flag ");
//     //   Serial.println(cont_acq);
//     //   return new ESP32SDCardConnection(stub, cont_acq);
//     // }
//
//   }
//
// }



// For those processors that don't require a parameter
// ESP32Processor* ESP32TrackerManager::ProcessFactory(JsonObject &process)
// {
//
//   const char* name = process["name"];
//   const char* message_format = process["message_format"];
//   const char* message_transport = process["message_transport"];
//
//   // Constant char strings for the processors available
//   const char* cadence_process_name = "cadence";
//   const char* sf_process_name = "sensorfusion";
//   const char* geo_process_name = "geolocation";
//   const char* raw_process_name = "raw";
//   const char* impulse_process_name = "impulse";
//   const char* activity_process_name = "activity";
//
//   // For characterization
//   const char* sample_freq_process_name = "sample_frequency";
//   const char* sample_stats_process_name = "sample_statistics";
//
//   Serial.print("INFO: Setting up processor ");
//   Serial.println(name);
//
//   // Return the Class of the processor if requested in the JSON
//   if (strcmp(name, cadence_process_name) == 0) return new ESP32Cadence(message_format,message_transport);
//
//   if (strcmp(name, activity_process_name) == 0){
//
//     float low_threshold = 0.1;
//     float mid_threshold = 0.5;
//     float hi_threshold = 1.0;
//
//     const char* buf_low_thresh = 0;
//     buf_low_thresh = process["low_threshold"];
//     if(buf_low_thresh[0] != '\0')  low_threshold = String(buf_low_thresh).toFloat();
//
//     const char* buf_mid_thresh = 0;
//     buf_mid_thresh = process["mid_threshold"];
//     if(buf_mid_thresh[0] != '\0')  mid_threshold = String(buf_mid_thresh).toFloat();
//
//
//     const char* buf_hi_thresh = 0;
//     buf_hi_thresh = process["high_threshold"];
//     if(buf_hi_thresh[0] != '\0')  hi_threshold = String(buf_hi_thresh).toFloat();
//
//     return new ESP32Activity(message_format,message_transport, low_threshold, mid_threshold, high_threshold);
//   }
//
//   if (strcmp(name, sample_freq_process_name) == 0){
//     int npoints = atoi(process["num_points"]);// Need to check if this exists
//     return (new ESP32SampleFrequency(message_format,message_transport,npoints));
//   }
//
//   if (strcmp(name, sample_stats_process_name) == 0){
//     int npoints = atoi(process["num_points"]);// Need to check if this exists
//     std::vector<bool> onoff(9,true);
//     onoff[0] = (bool) process["ax_enable"];onoff[1] = (bool) process["ay_enable"];onoff[2] = (bool) process["az_enable"];
//     onoff[3] = (bool) process["gx_enable"];onoff[4] = (bool) process["gy_enable"];onoff[5] = (bool) process["gz_enable"];
//     onoff[6] = (bool) process["mx_enable"];onoff[7] = (bool) process["my_enable"];onoff[8] = (bool) process["mz_enable"];
//     return (new ESP32SampleStatistics(message_format,message_transport,npoints,onoff));
//   }
//
//
//   if (strcmp(name, sf_process_name) == 0) return new ESP32SensorFusion(true,false,message_format,message_transport);
//   // if (strcmp(name, geo_process_name) == 0) return new ESP32Geolocation(message_format,message_transport);
//   if (strcmp(name, raw_process_name) == 0) return new ESP32RawData(message_format,message_transport);
//   if (strcmp(name, impulse_process_name) == 0)
//   {
//
//     int buf_size = atoi(process["buffer_size"]);
//     bool accel_enable = (bool) process["accel_enable"];
//     bool gyro_enable = (bool) process["gyro_enable"];
//     bool mag_enable = (bool) process["mag_enable"];
//
//     int buf_delay = atoi(process["trigger_delay"]);
//     int coord = atoi(process["trigger_coord"]);
//     const char* buf_thresh = process["trigger_threshold"];
//     float threshold = String(buf_thresh).toFloat();
//     std::vector<bool> enables = {accel_enable,gyro_enable,mag_enable};
//
//     return new ESP32Impulse(message_format, message_transport, buf_size, threshold,  buf_delay, enables, coord);
//   }
//
//   // Need to check that something has been selected here
//   Serial.println("INFO: Unknown Processor");
//
// }





// void ESP32TrackerManager::SetupConnections(JsonObject &root)
// {
//   Serial.println("INFO: Setting up connections");
//   // Loop over all elements that are within the processors
//   JsonArray& json_connections = root["connections"];
//
//   fDataTransferEnable = false;
//
//   for (auto& connection : json_connections){
//
//     fConnections.push_back(ConnectionFactory(connection));
//     Serial.println("INFO: Initializing connections");
//     (fConnections.back())->Initialize();
//     Serial.println("INFO: Starting connections");
//     (fConnections.back())->Start();
//
//     // Check if we're able to transfer data using the Web or Wifi
//     fDataTransferEnable = fDataTransferEnable || (fConnections.back())->IsType(ESP32Connection::ConnectionType::Wifi);
//     fDataTransferEnable = fDataTransferEnable || (fConnections.back())->IsType(ESP32Connection::ConnectionType::FTP);
//     fDataTransferEnable = fDataTransferEnable || (fConnections.back())->IsType(ESP32Connection::ConnectionType::BLE);
//
//   }
//
//   if(fDataTransferEnable){
//     Serial.println("INFO: Data transfer is enabled");
//   } else {
//     Serial.println("INFO: Data transfer is not enabled");
//   }
//
// }


// void ESP32TrackerManager::SetupProcessors(JsonObject &root)
// {
//   // Loop over all elements that are within the processors
//   JsonArray& json_processors = root["processors"];
//
//   for (auto& process : json_processors){
//
//     // Check whether it is a process that accepts arguments
//     // fProcessors.push_back(ProcessFactory(process["name"], process["message_format"], process["message_transport"]));
//     // (fProcessors.back())->Setup();
//     fProcessors.push_back(ProcessFactory(process));
//
//     // Setup the processor
//     (fProcessors.back())->Setup();
//
//   }
// };




void ESP32TrackerManager::StartIMU()
{


  // Loop over the sensors
  for(auto sensor: fSensors)
  {
    // Print the type
    Serial.print("INFO: Starting IMU sensor "); Serial.println((int) sensor->GetType());

    // Get the sensor type
    if(sensor->IsType(ESP32Sensor::SensorType::Accelerometer))
    {
      sensor->ConfigureIMU(&imu);
      AccelSetup=true;
    }

