dancekickrun/DKRZero/ESP32TrackerManager.cpp
    if(sensor->IsType(ESP32Sensor::SensorType::Gyroscope))
    {
      sensor->ConfigureIMU(&imu);
      GyroSetup=true;
    }

    if(sensor->IsType(ESP32Sensor::SensorType::Magnetometer))
    {
      sensor->ConfigureIMU(&imu);
      MagSetup=true;
    }


  }

  bool all_sensors_setup  = AccelSetup && MagSetup && GyroSetup;
  Serial.print("INFO: Accelerometer definition flag "); Serial.println(AccelSetup);
  Serial.print("INFO: Magnetometer definition flag "); Serial.println(MagSetup);
  Serial.print("INFO: Gyroscope definition flag "); Serial.println(GyroSetup);

  if(!all_sensors_setup) PrintError(Error::NotAllSensorsDefined, String("Sensor block definitions incomplete"));

  if(!imu.begin()) PrintError(Error::IMUCommsFail, String("Failed to communicate with LSM9DS1."));

  Serial.println("INFO: IMU Started");

}

//
// "processors": [ "sensor_fusion", "cadence" ]
//
// void ESP32TrackerManager::Process(){
//
//   // Loop over all processes
//
// }


void ESP32TrackerManager::Acquisition()
{

  // Get the raw data
  SetTime();
  IMUAcquisition();

  // Serial.print("State Updated "); Serial.println(fStateUpdated);
  if(!fStateUpdated) return;



  // Loop over the processors
  unsigned long startMillis = millis();
  unsigned long cur = millis();
  for(auto process: fProcessors){

    // startMillis = millis();
    process->ProcessData(fCurrentTime,lat,lon,ax,ay,az,gx,gy,gz,mx,my,mz);
    // cur = millis();
    // Serial.print("ProcessData ");
    // Serial.println(cur-startMillis);

    fOutputMessage+=process->Message();
    fOutputMessage+="\n";
    fMessageCount++;
    if((fMessageCount%20)==0)
    {
      Serial.println(fOutputMessage);
      fOutputMessage="";
    }

    // startMillis = millis();
    if(process->GetDataReady())
    {
      for(auto connection: fConnections)
      {
        connection->Communicate(process->Message());
      }
    }
    // cur = millis();
    // Serial.print("Communicate ");
    // Serial.println(cur-startMillis);



  }

  // Get the message
  // if(fStateUpdated) for(auto process: fProcessors) process->Communicate(fESP32Config);

  // Serial.println("");


}

void ESP32TrackerManager::IMUAcquisition()
{
  float tmpx,tmpy,tmpz;

  // Read the sensors
  if(imu.tempAvailable())
  {
    imu.readTemp();
    temperature = imu.temperature;
  }

  //   accel_data_available = fESP32Config->GetAccelerometerEnable(0) && fESP32Config->GetIMU()->accelAvailable();
  //   gyro_data_available = fESP32Config->GetGyroscopeEnable() && fESP32Config->GetIMU()->gyroAvailable();
  //   mag_data_available = fESP32Config->GetMagnetometerEnable()  && fESP32Config->GetIMU()->magAvailable();
  //   gps_data_available = fESP32Config->GetGPSEnable()  && fESP32Config->GetGPS()->read();
  //   temperature_data_available = fESP32Config->GetTemperatureEnable() && fESP32Config->GetIMU()->tempAvailable();

  // Read Accelerometer
  if(imu.accelAvailable())
  {
    imu.readAccel();
    tmpx = ax;
    tmpy = ay;
    tmpz = az;
    ax = imu.calcAccel(imu.ax);
    ay = imu.calcAccel(imu.ay);
    az = imu.calcAccel(imu.az);
    fAccelStateUpdated = !( (ax==tmpx) && (ay==tmpy) && (az==tmpz) );
  }

  // Read the gyro
  if(imu.gyroAvailable())
  {
    imu.readGyro();
    tmpx = gx;
    tmpy = gy;
    tmpz = gz;
    gx = imu.calcGyro(imu.gx);
    gy = imu.calcGyro(imu.gy);
    gz = imu.calcGyro(imu.gz);
    fGyroStateUpdated = !( (gx==tmpx) && (gy==tmpy) && (gz==tmpz) );
  }

  // Read the magnetometer
  if(imu.magAvailable())
  {
    tmpx = mx;
    tmpy = my;
    tmpz = mz;
    imu.readMag();
    mx = imu.calcMag(imu.mx);
    my = imu.calcMag(imu.my);
    mz = imu.calcMag(imu.mz);
    fMagStateUpdated = !( (mx==tmpx) && (my==tmpy) && (mz==tmpz) );
  }

  // TODO Insert code to read GPS
  fState = fAccelStateUpdated
  + 2*fGyroStateUpdated
  + 4*fMagStateUpdated
  + 8*fGPSStateUpdated;

  fStateUpdated = fAccelStateUpdated || fGyroStateUpdated || fMagStateUpdated || fGPSStateUpdated;


}



// void ESP32TrackerManager::IMUAcquisition(){
//   // if(!fSilentRunning) Serial.println("IMUAcquisition()");
//   fAccelStateUpdated = false;
//   fGyroStateUpdated = false;
//   fMagStateUpdated = false;
//   fGPSStateUpdated = false;
//
//   accel_data_available = fESP32Config->GetAccelerometerEnable(0) && fESP32Config->GetIMU()->accelAvailable();
//   gyro_data_available = fESP32Config->GetGyroscopeEnable() && fESP32Config->GetIMU()->gyroAvailable();
//   mag_data_available = fESP32Config->GetMagnetometerEnable()  && fESP32Config->GetIMU()->magAvailable();
//   gps_data_available = fESP32Config->GetGPSEnable()  && fESP32Config->GetGPS()->read();
//   temperature_data_available = fESP32Config->GetTemperatureEnable() && fESP32Config->GetIMU()->tempAvailable();
//
//
//
//   if(temperature_data_available){
//     fESP32Config->GetIMU()->readTemp();
//     temperature = fESP32Config->GetIMU()->temperature;
//   } else {
//     temperature = -1;
//   }
//
//   if(accel_data_available){
//     fESP32Config->GetIMU()->readAccel();
//     float tmpx = ax;
//     float tmpy = ay;
//     float tmpz = az;
//     ax = fESP32Config->GetIMU()->calcAccel(fESP32Config->GetIMU()->ax);
//     ay = fESP32Config->GetIMU()->calcAccel(fESP32Config->GetIMU()->ay);
//     az = fESP32Config->GetIMU()->calcAccel(fESP32Config->GetIMU()->az);
//     fAccelStateUpdated = !( (ax==tmpx) && (ay==tmpy) && (az==tmpz) );
//   }
//   if(gyro_data_available){
//     fESP32Config->GetIMU()->readGyro();
//     float tmpx = gx;
//     float tmpy = gy;
//     float tmpz = gz;
//     gx = fESP32Config->GetIMU()->calcGyro(fESP32Config->GetIMU()->gx);
//     gy = fESP32Config->GetIMU()->calcGyro(fESP32Config->GetIMU()->gy);
//     gz = fESP32Config->GetIMU()->calcGyro(fESP32Config->GetIMU()->gz);
//     fGyroStateUpdated = !( (gx==tmpx) && (gy==tmpy) && (gz==tmpz) );
//   }
//   if (mag_data_available){
//     float tmpx = mx;
//     float tmpy = my;
//     float tmpz = mz;
//     fESP32Config->GetIMU()->readMag();
//     mx = fESP32Config->GetIMU()->calcMag(fESP32Config->GetIMU()->mx);
//     my = fESP32Config->GetIMU()->calcMag(fESP32Config->GetIMU()->my);
//     mz = fESP32Config->GetIMU()->calcMag(fESP32Config->GetIMU()->mz);
//     fMagStateUpdated = !( (mx==tmpx) && (my==tmpy) && (mz==tmpz) );
//   }
//   if(gps_data_available){
//     digitalWrite(13, 1);
//     currentLocation = fESP32Config->GetGPS()->getGeolocation();
//     float tmplat = lat;
//     float tmplon = lon;
//     lat = (float) currentLocation.latitude;
//     lon = (float) currentLocation.longitude;
//     fGPSStateUpdated = !( (lon==tmplon) && (lat==tmplat) );
//   } else {
//     digitalWrite(13, 0);
//   }
//
//   fState = fAccelStateUpdated
//   + 2*fGyroStateUpdated
//   + 4*fMagStateUpdated
//   + 8*fGPSStateUpdated;
//
//   fStateUpdated = fAccelStateUpdated || fGyroStateUpdated || fMagStateUpdated || fGPSStateUpdated;
//
//   // if(fStateUpdated && fSensorFusionEnable) SensorFusion();
//
//   if(!fStateUpdated){
//     // Check whether we've lost touch with the data and reset if we have
//     fRescueCount+=1;
//     if(fRescueCount>100) Restart();
//   } else {
//     fRescueCount = 0;
//   }
//
// }

void ESP32TrackerManager::Update(){

