dancekickrun/DKRZero/ESP32TrackerManager.cpp
  SetTime();

  switch (ESP32_State)
  {

    case State::Initialize:
    Configure();
    break;


    case State::Acquisition:

    // Check whether free-running acquisition or not
    if(fMeasurementInterval>0){

      // Check if the chosen time has elapsed for the data rate
      if ((fCurrentTime - fLastTime) >= (long) fMeasurementInterval)
      {
        // Save the last time you blinked the LED
        fLastTime = fCurrentTime;
        // Acquire the data
        Acquisition();
      }

    }else{

      // Acquire the data in a free-running mode
      Acquisition();

    }


    // To transfer into FTP mode
    // Check if button 0 has been pressed
    if( (digitalRead(0) == LOW) )
    { // Check if button has been pressed
      while (digitalRead(0) == LOW); // Wait for button to be released
      Serial.println("INFO: Pausing data acquisition");
      ESP32_State = State::Paused;
    }

    break;


    case State::Paused:

    // Every second flash the LED
    if ((fCurrentTime - fLastTime) > 1000)
    {
      fLastTime = fCurrentTime;
      if (fLEDState == LOW)
      {
        fLEDState = HIGH;
      } else {
        fLEDState = LOW;
      }
      digitalWrite(5, fLEDState);
    }

    // Check if button has been pressed
    if( (digitalRead(0) == LOW) )
    {
      while (digitalRead(0) == LOW); // Wait for button to be released
      Serial.println("INFO: Changing to data acquisition mode");

      // Turn off the LED
      if (fLEDState == HIGH) fLEDState = LOW;
      digitalWrite(5, fLEDState);
      ESP32_State = State::Acquisition;
    }

    // case State::Transfer:
    //
    // // Every second flash the LED
    // if ((fCurrentTime - fLastTime) > 1000)
    // {
    //   fLastTime = fCurrentTime;
    //   if (fLEDState == LOW)
    //   {
    //     fLEDState = HIGH;
    //   } else {
    //     fLEDState = LOW;
    //   }
    //   digitalWrite(5, fLEDState);
    // }
    //
    // // Update the FTP connection
    // // CheckFTP();
    // // delay(50);
    //
    // // Check if button has been pressed
    // if( (digitalRead(0) == LOW) )
    // {
    //   while (digitalRead(0) == LOW); // Wait for button to be released
    //   Serial.println("INFO: Changing to data acquisition mode");
    //
    //   // Turn off the LED
    //   if (fLEDState == HIGH) fLEDState = LOW;
    //   digitalWrite(5, fLEDState);
    //
    //   // Disconnect from wifi if MQTT is false and WIFI is true
    //   // if((!fESP32Config->GetMQTTEnable()) && (fESP32Config->GetWifiEnable()))
    //   //     fESP32Config->DisconnectWifi();
    //
    //   ESP32_State = State::Acquisition;
    //
    // }

    break;

  }


  fStateUpdated = false;

  // if(fCurrentTime>10000) Reset();

}


void ESP32TrackerManager::Restart(){ ESP.restart();}



void ESP32TrackerManager::Indicator(int nflash, int led_on_ms=250, int led_off_ms=250,int led_end_pause=1000){

  const int LED_PIN = 5;

  // Put status to flashing code here:
  for(int i=0;i<nflash;i++){
    digitalWrite(LED_PIN, HIGH); // Turn on LED
    delay(led_on_ms);
    digitalWrite(LED_PIN, LOW); // Turn on LED
    delay(led_off_ms);
  }
  delay(led_end_pause);

}
